INSERT INTO visa_place (latitude, longitude, visaplace_id, address, description, name, phone_number) VALUES
(37.5265, 126.8671, 1, '서울 양천구 목동동로 151', '외국인 체류, 비자 관련 주무기관', '서울출입국외국인청', '02-2650-6212'),
(37.5665, 126.9780, 2, '서울 종로구 세종대로 209', '체류자격, 사증연장 등 법무부 민원 전반', '법무부 민원센터', '02-2110-0000'),
(37.5712, 126.9769, 3, '서울 종로구 종로 1길 8', '영사, 여권, 비자 민원 서비스 제공', '외교부 영사서비스센터', '02-2100-2114'),
(37.5663, 126.9785, 4, '서울 종로구 종로 38 서울글로벌센터', '외국인 대상 종합지원서비스 제공', '서울글로벌센터', '02-2075-4180'),
(37.5734, 126.9902, 5, '서울 종로구 이화동 1', '외국인 체류/비자 관련 1345 상담 센터 운영', '외국인종합안내센터', '1345'),
(37.5268, 126.8635, 6, 'https://www.hikorea.go.kr', '비자·출입국 관련 온라인 민원 포털', 'Hi Korea', NULL),
(37.5733, 126.9770, 7, '서울 종로구 세종대로 188', '미국 비자 신청 및 인터뷰 진행', '주한 미국 대사관', '02-397-4114'),
(37.5790, 126.9707, 8, '서울 종로구 율곡로2길 6', '일본 비자 민원 처리', '주한 일본 대사관', '02-2170-5200'),
(37.5798, 126.9983, 9, '서울 종로구 자하문로 85', '중국 비자 민원 처리', '주한 중국 대사관', '02-738-1038'),
(37.5611, 126.9827, 10, '서울 중구 명동 2가 105', '이민 관련 정보 및 외국인 교육 제공', '한국이민재단', '02-775-8989');

INSERT INTO visa_place (latitude, longitude, visaplace_id, address, description, name, phone_number) VALUES
(37.2635, 127.0286, 11, '경기 수원시 팔달구 효원로 307', '외국인 노동자 및 이민자 인권·생활 상담', '경기도외국인인권지원센터', '031-267-1527'),
(35.1396, 129.0452, 12, '부산 동구 중앙대로 365', '외국인 대상 비자/정착/노동/생활 지원', '부산외국인주민지원센터', '051-714-2910'),
(37.3900, 126.6390, 13, '인천 연수구 갯벌로 12', '체류자격, 생활상담, 통번역 서비스', '인천글로벌센터', '032-722-7931'),
(36.3327, 127.4548, 14, '대전 동구 동서대로 1672', '대전·충청 외국인 체류자 지원 기관', '대전외국인복지관', '042-622-1626'),
(35.1486, 126.9182, 15, '광주 동구 중앙로 196', '외국인 생활 정보 제공 및 비자 관련 상담', '광주글로벌센터', '062-228-2910'),
(37.6545, 126.7737, 16, '경기 고양시 일산동구 중앙로 1032', '노동자 대상 비자, 법률, 체류상담', '외국인노동자지원센터 (고양)', '031-975-0702'),
(37.1336, 126.9224, 17, '경기 화성시 향남읍 향남로 470', '체류비자 상담, 취업정보 제공', '화성외국인복지센터', '031-366-1179'),
(33.5006, 126.5305, 18, '제주 제주시 서광로 2길 24', '외국인, 다문화 가정 대상 종합 지원 센터', '제주다문화센터', '064-722-2173'),
(37.4967, 127.0296, 19, '서울 강남구 강남대로 318', '이민·비자·체류 자격 전문 상담', '대한이민행정사협회', '02-568-1727'),
(35.2287, 128.6811, 20, '경남 창원시 성산구 중앙대로 104', '외국인 통합 지원, 행정/생활/노동 상담', '경남외국인주민통합지원센터', '055-299-2000');
